# 自定义数据 - 合并

![](https://github.com/tim530712345/20210626/blob/main/images/5.jpg?raw=1)

### 导入相关库

In [1]:
import pandas as pd

### 创建数据

In [ ]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan'],
        'age': ['20', '25', '30', '35', '40']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### 将上述的数据框分别命名为data1, data2, data3

In [ ]:
data1 = pd.DataFrame(raw_data_1, columns = ['subject_id', 'first_name', 'last_name'])
data2 = pd.DataFrame(raw_data_2, columns = ['subject_id', 'first_name', 'last_name','age'])
data3 = pd.DataFrame(raw_data_3, columns = ['subject_id', 'test_id'])

### 将data1和data2两个数据框按照行的维度进行合并，命名为all_data

In [ ]:
data1

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [ ]:
all_data = pd.concat([data1, data2], axis=0)
all_data

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   age first_name last_name subject_id
0  NaN       Alex  Anderson          1
1  NaN        Amy  Ackerman          2
2  NaN      Allen       Ali          3
3  NaN      Alice      Aoni          4
4  NaN     Ayoung   Atiches          5
0   20      Billy    Bonder          4
1   25      Brian     Black          5
2   30       Bran   Balwner          6
3   35      Bryce     Brice          7
4   40      Betty    Btisan          8

### 将data1和data2两个数据框按照列的维度进行合并，命名为all_data_col

In [ ]:
all_data_col = pd.concat([data1, data2], axis=1)
all_data_col

  subject_id first_name last_name subject_id first_name last_name age
0          1       Alex  Anderson          4      Billy    Bonder  20
1          2        Amy  Ackerman          5      Brian     Black  25
2          3      Allen       Ali          6       Bran   Balwner  30
3          4      Alice      Aoni          7      Bryce     Brice  35
4          5     Ayoung   Atiches          8      Betty    Btisan  40

### 打印data3

In [ ]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### 按照subject_id的值对all_data和data3作合并

In [ ]:
pd.merge(all_data, data3, on='subject_id') # 能對應到的都秀出來 沒有的拿掉

   age first_name last_name subject_id  test_id
0  NaN       Alex  Anderson          1       51
1  NaN        Amy  Ackerman          2       15
2  NaN      Allen       Ali          3       15
3  NaN      Alice      Aoni          4       61
4   20      Billy    Bonder          4       61
5  NaN     Ayoung   Atiches          5       16
6   25      Brian     Black          5       16
7   35      Bryce     Brice          7       14
8   40      Betty    Btisan          8       15

### 对data1和data2按照subject_id作连接

In [ ]:
pd.merge(data1, data2, on='subject_id')

  subject_id first_name_x last_name_x first_name_y last_name_y age
0          4        Alice        Aoni        Billy      Bonder  20
1          5       Ayoung     Atiches        Brian       Black  25

### 找到 data1 和 data2 合并之后的所有匹配结果

In [ ]:
pd.merge(data1, data2, on='subject_id', how='outer') # 沒有的數值填入空值

  subject_id first_name_x last_name_x first_name_y last_name_y  age
0          1         Alex    Anderson          NaN         NaN  NaN
1          2          Amy    Ackerman          NaN         NaN  NaN
2          3        Allen         Ali          NaN         NaN  NaN
3          4        Alice        Aoni        Billy      Bonder   20
4          5       Ayoung     Atiches        Brian       Black   25
5          6          NaN         NaN         Bran     Balwner   30
6          7          NaN         NaN        Bryce       Brice   35
7          8          NaN         NaN        Betty      Btisan   40